export type ProvinceAgency = {
  name: string;
  value: number;
};

export type ProvinceMetric = {
  name: string;
  value: number;
  agencies: ProvinceAgency[];
  id: number;
};

export const geoMapData: ProvinceMetric[] = [
      {
        name: 'กรุงเทพมหานคร',
        value: 12,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดกรุงเทพมหานคร',
            value: 4,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดกรุงเทพมหานคร',
            value: 2,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดกรุงเทพมหานคร',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดกรุงเทพมหานคร',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดกรุงเทพมหานคร',
            value: 6,
          },
        ],
        id: 0,
      },
      {
        name: 'สมุทรปราการ',
        value: 7,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสมุทรปราการ',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสมุทรปราการ',
            value: 5,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสมุทรปราการ',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสมุทรปราการ',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสมุทรปราการ',
            value: 0,
          },
        ],
        id: 1,
      },
      {
        name: 'นนทบุรี',
        value: 18,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดนนทบุรี',
            value: 8,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดนนทบุรี',
            value: 3,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดนนทบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดนนทบุรี',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดนนทบุรี',
            value: 6,
          },
        ],
        id: 2,
      },
      {
        name: 'ปทุมธานี',
        value: 9,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดปทุมธานี',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดปทุมธานี',
            value: 2,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดปทุมธานี',
            value: 2,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดปทุมธานี',
            value: 4,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดปทุมธานี',
            value: 0,
          },
        ],
        id: 3,
      },
      {
        name: 'พระนครศรีอยุธยา',
        value: 6,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดพระนครศรีอยุธยา',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดพระนครศรีอยุธยา',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดพระนครศรีอยุธยา',
            value: 2,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดพระนครศรีอยุธยา',
            value: 3,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดพระนครศรีอยุธยา',
            value: 1,
          },
        ],
        id: 4,
      },
      {
        name: 'อ่างทอง',
        value: 4,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดอ่างทอง',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดอ่างทอง',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดอ่างทอง',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดอ่างทอง',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดอ่างทอง',
            value: 4,
          },
        ],
        id: 5,
      },
      {
        name: 'ลพบุรี',
        value: 11,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดลพบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดลพบุรี',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดลพบุรี',
            value: 10,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดลพบุรี',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดลพบุรี',
            value: 0,
          },
        ],
        id: 6,
      },
      {
        name: 'สิงห์บุรี',
        value: 3,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสิงห์บุรี',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสิงห์บุรี',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสิงห์บุรี',
            value: 3,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสิงห์บุรี',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสิงห์บุรี',
            value: 0,
          },
        ],
        id: 7,
      },
      {
        name: 'สระบุรี',
        value: 10,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสระบุรี',
            value: 5,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสระบุรี',
            value: 5,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสระบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสระบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสระบุรี',
            value: 0,
          },
        ],
        id: 8,
      },
      {
        name: 'ชลบุรี',
        value: 14,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดชลบุรี',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดชลบุรี',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดชลบุรี',
            value: 10,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดชลบุรี',
            value: 3,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดชลบุรี',
            value: 0,
          },
        ],
        id: 9,
      },
      {
        name: 'ระยอง',
        value: 13,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดระยอง',
            value: 12,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดระยอง',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดระยอง',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดระยอง',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดระยอง',
            value: 0,
          },
        ],
        id: 10,
      },
      {
        name: 'จันทบุรี',
        value: 5,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดจันทบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดจันทบุรี',
            value: 3,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดจันทบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดจันทบุรี',
            value: 2,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดจันทบุรี',
            value: 0,
          },
        ],
        id: 11,
      },
      {
        name: 'ตราด',
        value: 2,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดตราด',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดตราด',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดตราด',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดตราด',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดตราด',
            value: 0,
          },
        ],
        id: 12,
      },
      {
        name: 'ฉะเชิงเทรา',
        value: 9,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดฉะเชิงเทรา',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดฉะเชิงเทรา',
            value: 3,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดฉะเชิงเทรา',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดฉะเชิงเทรา',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดฉะเชิงเทรา',
            value: 6,
          },
        ],
        id: 13,
      },
      {
        name: 'ปราจีนบุรี',
        value: 6,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดปราจีนบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดปราจีนบุรี',
            value: 6,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดปราจีนบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดปราจีนบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดปราจีนบุรี',
            value: 0,
          },
        ],
        id: 14,
      },
      {
        name: 'นครนายก',
        value: 4,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดนครนายก',
            value: 2,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดนครนายก',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดนครนายก',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดนครนายก',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดนครนายก',
            value: 1,
          },
        ],
        id: 15,
      },
      {
        name: 'สระแก้ว',
        value: 7,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสระแก้ว',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสระแก้ว',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสระแก้ว',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสระแก้ว',
            value: 3,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสระแก้ว',
            value: 2,
          },
        ],
        id: 16,
      },
      {
        name: 'นครราชสีมา',
        value: 16,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดนครราชสีมา',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดนครราชสีมา',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดนครราชสีมา',
            value: 5,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดนครราชสีมา',
            value: 3,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดนครราชสีมา',
            value: 7,
          },
        ],
        id: 17,
      },
      {
        name: 'บุรีรัมย์',
        value: 12,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดบุรีรัมย์',
            value: 6,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดบุรีรัมย์',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดบุรีรัมย์',
            value: 5,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดบุรีรัมย์',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดบุรีรัมย์',
            value: 0,
          },
        ],
        id: 18,
      },
      {
        name: 'สุรินทร์',
        value: 8,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสุรินทร์',
            value: 7,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสุรินทร์',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสุรินทร์',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสุรินทร์',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสุรินทร์',
            value: 0,
          },
        ],
        id: 19,
      },
      {
        name: 'ศรีสะเกษ',
        value: 10,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดศรีสะเกษ',
            value: 4,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดศรีสะเกษ',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดศรีสะเกษ',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดศรีสะเกษ',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดศรีสะเกษ',
            value: 6,
          },
        ],
        id: 20,
      },
      {
        name: 'อุบลราชธานี',
        value: 17,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดอุบลราชธานี',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดอุบลราชธานี',
            value: 14,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดอุบลราชธานี',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดอุบลราชธานี',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดอุบลราชธานี',
            value: 3,
          },
        ],
        id: 21,
      },
      {
        name: 'ยโสธร',
        value: 5,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดยโสธร',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดยโสธร',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดยโสธร',
            value: 5,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดยโสธร',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดยโสธร',
            value: 0,
          },
        ],
        id: 22,
      },
      {
        name: 'ชัยภูมิ',
        value: 11,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดชัยภูมิ',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดชัยภูมิ',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดชัยภูมิ',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดชัยภูมิ',
            value: 4,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดชัยภูมิ',
            value: 5,
          },
        ],
        id: 23,
      },
      {
        name: 'อำนาจเจริญ',
        value: 6,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดอำนาจเจริญ',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดอำนาจเจริญ',
            value: 3,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดอำนาจเจริญ',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดอำนาจเจริญ',
            value: 3,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดอำนาจเจริญ',
            value: 0,
          },
        ],
        id: 24,
      },
      {
        name: 'บึงกาฬ',
        value: 3,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดบึงกาฬ',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดบึงกาฬ',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดบึงกาฬ',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดบึงกาฬ',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดบึงกาฬ',
            value: 1,
          },
        ],
        id: 25,
      },
      {
        name: 'หนองบัวลำภู',
        value: 4,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดหนองบัวลำภู',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดหนองบัวลำภู',
            value: 4,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดหนองบัวลำภู',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดหนองบัวลำภู',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดหนองบัวลำภู',
            value: 0,
          },
        ],
        id: 26,
      },
      {
        name: 'ขอนแก่น',
        value: 15,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดขอนแก่น',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดขอนแก่น',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดขอนแก่น',
            value: 15,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดขอนแก่น',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดขอนแก่น',
            value: 0,
          },
        ],
        id: 27,
      },
      {
        name: 'อุดรธานี',
        value: 14,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดอุดรธานี',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดอุดรธานี',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดอุดรธานี',
            value: 13,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดอุดรธานี',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดอุดรธานี',
            value: 0,
          },
        ],
        id: 28,
      },
      {
        name: 'เลย',
        value: 7,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดเลย',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดเลย',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดเลย',
            value: 4,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดเลย',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดเลย',
            value: 3,
          },
        ],
        id: 29,
      },
      {
        name: 'หนองคาย',
        value: 6,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดหนองคาย',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดหนองคาย',
            value: 2,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดหนองคาย',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดหนองคาย',
            value: 2,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดหนองคาย',
            value: 2,
          },
        ],
        id: 30,
      },
      {
        name: 'มหาสารคาม',
        value: 9,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดมหาสารคาม',
            value: 8,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดมหาสารคาม',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดมหาสารคาม',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดมหาสารคาม',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดมหาสารคาม',
            value: 0,
          },
        ],
        id: 31,
      },
      {
        name: 'ร้อยเอ็ด',
        value: 12,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดร้อยเอ็ด',
            value: 12,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดร้อยเอ็ด',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดร้อยเอ็ด',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดร้อยเอ็ด',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดร้อยเอ็ด',
            value: 0,
          },
        ],
        id: 32,
      },
      {
        name: 'กาฬสินธุ์',
        value: 8,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดกาฬสินธุ์',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดกาฬสินธุ์',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดกาฬสินธุ์',
            value: 4,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดกาฬสินธุ์',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดกาฬสินธุ์',
            value: 2,
          },
        ],
        id: 33,
      },
      {
        name: 'สกลนคร',
        value: 10,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสกลนคร',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสกลนคร',
            value: 7,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสกลนคร',
            value: 3,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสกลนคร',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสกลนคร',
            value: 0,
          },
        ],
        id: 34,
      },
      {
        name: 'นครพนม',
        value: 5,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดนครพนม',
            value: 2,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดนครพนม',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดนครพนม',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดนครพนม',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดนครพนม',
            value: 1,
          },
        ],
        id: 35,
      },
      {
        name: 'มุกดาหาร',
        value: 4,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดมุกดาหาร',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดมุกดาหาร',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดมุกดาหาร',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดมุกดาหาร',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดมุกดาหาร',
            value: 2,
          },
        ],
        id: 36,
      },
      {
        name: 'เชียงใหม่',
        value: 18,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดเชียงใหม่',
            value: 2,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดเชียงใหม่',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดเชียงใหม่',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดเชียงใหม่',
            value: 5,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดเชียงใหม่',
            value: 11,
          },
        ],
        id: 37,
      },
      {
        name: 'เชียงราย',
        value: 14,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดเชียงราย',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดเชียงราย',
            value: 2,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดเชียงราย',
            value: 9,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดเชียงราย',
            value: 3,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดเชียงราย',
            value: 0,
          },
        ],
        id: 38,
      },
      {
        name: 'ลำปาง',
        value: 9,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดลำปาง',
            value: 4,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดลำปาง',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดลำปาง',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดลำปาง',
            value: 4,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดลำปาง',
            value: 1,
          },
        ],
        id: 39,
      },
      {
        name: 'ลำพูน',
        value: 6,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดลำพูน',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดลำพูน',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดลำพูน',
            value: 3,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดลำพูน',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดลำพูน',
            value: 1,
          },
        ],
        id: 40,
      },
      {
        name: 'แม่ฮ่องสอน',
        value: 3,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดแม่ฮ่องสอน',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดแม่ฮ่องสอน',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดแม่ฮ่องสอน',
            value: 3,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดแม่ฮ่องสอน',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดแม่ฮ่องสอน',
            value: 0,
          },
        ],
        id: 41,
      },
      {
        name: 'น่าน',
        value: 7,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดน่าน',
            value: 2,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดน่าน',
            value: 3,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดน่าน',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดน่าน',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดน่าน',
            value: 1,
          },
        ],
        id: 42,
      },
      {
        name: 'พะเยา',
        value: 5,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดพะเยา',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดพะเยา',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดพะเยา',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดพะเยา',
            value: 3,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดพะเยา',
            value: 0,
          },
        ],
        id: 43,
      },
      {
        name: 'แพร่',
        value: 6,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดแพร่',
            value: 3,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดแพร่',
            value: 2,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดแพร่',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดแพร่',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดแพร่',
            value: 0,
          },
        ],
        id: 44,
      },
      {
        name: 'อุตรดิตถ์',
        value: 4,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดอุตรดิตถ์',
            value: 4,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดอุตรดิตถ์',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดอุตรดิตถ์',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดอุตรดิตถ์',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดอุตรดิตถ์',
            value: 0,
          },
        ],
        id: 45,
      },
      {
        name: 'พิษณุโลก',
        value: 11,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดพิษณุโลก',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดพิษณุโลก',
            value: 9,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดพิษณุโลก',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดพิษณุโลก',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดพิษณุโลก',
            value: 1,
          },
        ],
        id: 46,
      },
      {
        name: 'สุโขทัย',
        value: 8,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสุโขทัย',
            value: 2,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสุโขทัย',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสุโขทัย',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสุโขทัย',
            value: 3,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสุโขทัย',
            value: 2,
          },
        ],
        id: 47,
      },
      {
        name: 'ตาก',
        value: 7,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดตาก',
            value: 3,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดตาก',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดตาก',
            value: 3,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดตาก',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดตาก',
            value: 0,
          },
        ],
        id: 48,
      },
      {
        name: 'กำแพงเพชร',
        value: 6,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดกำแพงเพชร',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดกำแพงเพชร',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดกำแพงเพชร',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดกำแพงเพชร',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดกำแพงเพชร',
            value: 3,
          },
        ],
        id: 49,
      },
      {
        name: 'พิจิตร',
        value: 5,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดพิจิตร',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดพิจิตร',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดพิจิตร',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดพิจิตร',
            value: 3,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดพิจิตร',
            value: 0,
          },
        ],
        id: 50,
      },
      {
        name: 'เพชรบูรณ์',
        value: 9,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดเพชรบูรณ์',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดเพชรบูรณ์',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดเพชรบูรณ์',
            value: 6,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดเพชรบูรณ์',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดเพชรบูรณ์',
            value: 2,
          },
        ],
        id: 51,
      },
      {
        name: 'นครสวรรค์',
        value: 13,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดนครสวรรค์',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดนครสวรรค์',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดนครสวรรค์',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดนครสวรรค์',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดนครสวรรค์',
            value: 12,
          },
        ],
        id: 52,
      },
      {
        name: 'อุทัยธานี',
        value: 4,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดอุทัยธานี',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดอุทัยธานี',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดอุทัยธานี',
            value: 2,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดอุทัยธานี',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดอุทัยธานี',
            value: 1,
          },
        ],
        id: 53,
      },
      {
        name: 'ชัยนาท',
        value: 6,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดชัยนาท',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดชัยนาท',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดชัยนาท',
            value: 3,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดชัยนาท',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดชัยนาท',
            value: 2,
          },
        ],
        id: 54,
      },
      {
        name: 'สุพรรณบุรี',
        value: 10,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสุพรรณบุรี',
            value: 4,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสุพรรณบุรี',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสุพรรณบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสุพรรณบุรี',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสุพรรณบุรี',
            value: 4,
          },
        ],
        id: 55,
      },
      {
        name: 'กาญจนบุรี',
        value: 12,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดกาญจนบุรี',
            value: 3,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดกาญจนบุรี',
            value: 9,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดกาญจนบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดกาญจนบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดกาญจนบุรี',
            value: 0,
          },
        ],
        id: 56,
      },
      {
        name: 'ราชบุรี',
        value: 11,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดราชบุรี',
            value: 2,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดราชบุรี',
            value: 2,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดราชบุรี',
            value: 7,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดราชบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดราชบุรี',
            value: 0,
          },
        ],
        id: 57,
      },
      {
        name: 'นครปฐม',
        value: 9,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดนครปฐม',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดนครปฐม',
            value: 4,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดนครปฐม',
            value: 2,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดนครปฐม',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดนครปฐม',
            value: 3,
          },
        ],
        id: 58,
      },
      {
        name: 'สมุทรสาคร',
        value: 8,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสมุทรสาคร',
            value: 2,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสมุทรสาคร',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสมุทรสาคร',
            value: 6,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสมุทรสาคร',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสมุทรสาคร',
            value: 0,
          },
        ],
        id: 59,
      },
      {
        name: 'สมุทรสงคราม',
        value: 3,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสมุทรสงคราม',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสมุทรสงคราม',
            value: 3,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสมุทรสงคราม',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสมุทรสงคราม',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสมุทรสงคราม',
            value: 0,
          },
        ],
        id: 60,
      },
      {
        name: 'เพชรบุรี',
        value: 7,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดเพชรบุรี',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดเพชรบุรี',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดเพชรบุรี',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดเพชรบุรี',
            value: 3,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดเพชรบุรี',
            value: 2,
          },
        ],
        id: 61,
      },
      {
        name: 'ประจวบคีรีขันธ์',
        value: 6,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดประจวบคีรีขันธ์',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดประจวบคีรีขันธ์',
            value: 3,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดประจวบคีรีขันธ์',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดประจวบคีรีขันธ์',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดประจวบคีรีขันธ์',
            value: 2,
          },
        ],
        id: 62,
      },
      {
        name: 'นครศรีธรรมราช',
        value: 14,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดนครศรีธรรมราช',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดนครศรีธรรมราช',
            value: 13,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดนครศรีธรรมราช',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดนครศรีธรรมราช',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดนครศรีธรรมราช',
            value: 1,
          },
        ],
        id: 63,
      },
      {
        name: 'กระบี่',
        value: 9,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดกระบี่',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดกระบี่',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดกระบี่',
            value: 4,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดกระบี่',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดกระบี่',
            value: 4,
          },
        ],
        id: 64,
      },
      {
        name: 'พังงา',
        value: 5,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดพังงา',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดพังงา',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดพังงา',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดพังงา',
            value: 5,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดพังงา',
            value: 0,
          },
        ],
        id: 65,
      },
      {
        name: 'ภูเก็ต',
        value: 13,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดภูเก็ต',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดภูเก็ต',
            value: 10,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดภูเก็ต',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดภูเก็ต',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดภูเก็ต',
            value: 0,
          },
        ],
        id: 66,
      },
      {
        name: 'สุราษฎร์ธานี',
        value: 12,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสุราษฎร์ธานี',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสุราษฎร์ธานี',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสุราษฎร์ธานี',
            value: 11,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสุราษฎร์ธานี',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสุราษฎร์ธานี',
            value: 0,
          },
        ],
        id: 67,
      },
      {
        name: 'ระนอง',
        value: 4,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดระนอง',
            value: 2,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดระนอง',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดระนอง',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดระนอง',
            value: 2,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดระนอง',
            value: 0,
          },
        ],
        id: 68,
      },
      {
        name: 'ชุมพร',
        value: 8,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดชุมพร',
            value: 2,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดชุมพร',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดชุมพร',
            value: 3,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดชุมพร',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดชุมพร',
            value: 2,
          },
        ],
        id: 69,
      },
      {
        name: 'สงขลา',
        value: 15,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสงขลา',
            value: 14,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสงขลา',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสงขลา',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสงขลา',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสงขลา',
            value: 0,
          },
        ],
        id: 70,
      },
      {
        name: 'สตูล',
        value: 3,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดสตูล',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดสตูล',
            value: 3,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดสตูล',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดสตูล',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดสตูล',
            value: 0,
          },
        ],
        id: 71,
      },
      {
        name: 'ตรัง',
        value: 7,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดตรัง',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดตรัง',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดตรัง',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดตรัง',
            value: 7,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดตรัง',
            value: 0,
          },
        ],
        id: 72,
      },
      {
        name: 'พัทลุง',
        value: 6,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดพัทลุง',
            value: 3,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดพัทลุง',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดพัทลุง',
            value: 2,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดพัทลุง',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดพัทลุง',
            value: 0,
          },
        ],
        id: 73,
      },
      {
        name: 'ปัตตานี',
        value: 5,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดปัตตานี',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดปัตตานี',
            value: 0,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดปัตตานี',
            value: 3,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดปัตตานี',
            value: 0,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดปัตตานี',
            value: 2,
          },
        ],
        id: 74,
      },
      {
        name: 'ยะลา',
        value: 4,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดยะลา',
            value: 1,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดยะลา',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดยะลา',
            value: 1,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดยะลา',
            value: 1,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดยะลา',
            value: 0,
          },
        ],
        id: 75,
      },
      {
        name: 'นราธิวาส',
        value: 3,
        agencies: [
          {
            name: 'สำนักงานแรงงานจังหวัดนราธิวาส',
            value: 0,
          },
          {
            name: 'สำนักงานจัดหางานจังหวัดนราธิวาส',
            value: 1,
          },
          {
            name: 'สถาบันพัฒนาฝีมือแรงงานจังหวัดนราธิวาส',
            value: 0,
          },
          {
            name: 'สำนักงานประกันสังคมจังหวัดนราธิวาส',
            value: 2,
          },
          {
            name: 'สำนักงานสวัสดิการและคุ้มครองแรงงานจังหวัดนราธิวาส',
            value: 0,
          },
        ],
        id: 76,
      },
    
];

export const provinceNameMap: Record<string, string> = {
      'Amnat Charoen': 'อำนาจเจริญ',
      'Ang Thong': 'อ่างทอง',
      Bangkok: 'กรุงเทพมหานคร',
      'Bueng Kan': 'บึงกาฬ',
      'Buri Ram': 'บุรีรัมย์',
      Chachoengsao: 'ฉะเชิงเทรา',
      'Chai Nat': 'ชัยนาท',
      Chaiyaphum: 'ชัยภูมิ',
      Chanthaburi: 'จันทบุรี',
      'Chiang Mai': 'เชียงใหม่',
      'Chiang Rai': 'เชียงราย',
      'Chon Buri': 'ชลบุรี',
      Chumphon: 'ชุมพร',
      Kalasin: 'กาฬสินธุ์',
      'Kamphaeng Phet': 'กำแพงเพชร',
      Kanchanaburi: 'กาญจนบุรี',
      'Khon Kaen': 'ขอนแก่น',
      Krabi: 'กระบี่',
      Lampang: 'ลำปาง',
      Lamphun: 'ลำพูน',
      Loei: 'เลย',
      'Lop Buri': 'ลพบุรี',
      'Mae Hong Son': 'แม่ฮ่องสอน',
      'Maha Sarakham': 'มหาสารคาม',
      Mukdahan: 'มุกดาหาร',
      'Nakhon Nayok': 'นครนายก',
      'Nakhon Pathom': 'นครปฐม',
      'Nakhon Phanom': 'นครพนม',
      'Nakhon Ratchasima': 'นครราชสีมา',
      'Nakhon Sawan': 'นครสวรรค์',
      'Nakhon Si Thammarat': 'นครศรีธรรมราช',
      Nan: 'น่าน',
      Narathiwat: 'นราธิวาส',
      'Nong Bua Lam Phu': 'หนองบัวลำภู',
      'Nong Khai': 'หนองคาย',
      Nonthaburi: 'นนทบุรี',
      'Pathum Thani': 'ปทุมธานี',
      Pattani: 'ปัตตานี',
      Phangnga: 'พังงา',
      Phatthalung: 'พัทลุง',
      Phayao: 'พะเยา',
      Phetchabun: 'เพชรบูรณ์',
      Phetchaburi: 'เพชรบุรี',
      Phichit: 'พิจิตร',
      Phitsanulok: 'พิษณุโลก',
      Phrae: 'แพร่',
      Phuket: 'ภูเก็ต',
      'Prachin Buri': 'ปราจีนบุรี',
      'Prachuap Khiri Khan': 'ประจวบคีรีขันธ์',
      'Phra Nakhon Si Ayutthaya': 'พระนครศรีอยุธยา',
      Ranong: 'ระนอง',
      Ratchaburi: 'ราชบุรี',
      Rayong: 'ระยอง',
      'Roi Et': 'ร้อยเอ็ด',
      'Sa Kaeo': 'สระแก้ว',
      'Sakon Nakhon': 'สกลนคร',
      'Samut Prakan': 'สมุทรปราการ',
      'Samut Sakhon': 'สมุทรสาคร',
      'Samut Songkhram': 'สมุทรสงคราม',
      Saraburi: 'สระบุรี',
      Satun: 'สตูล',
      'Sing Buri': 'สิงห์บุรี',
      'Si Sa Ket': 'ศรีสะเกษ',
      Songkhla: 'สงขลา',
      Sukhothai: 'สุโขทัย',
      'Suphan Buri': 'สุพรรณบุรี',
      'Surat Thani': 'สุราษฎร์ธานี',
      Surin: 'สุรินทร์',
      Tak: 'ตาก',
      Trang: 'ตรัง',
      Trat: 'ตราด',
      'Ubon Ratchathani': 'อุบลราชธานี',
      'Udon Thani': 'อุดรธานี',
      'Uthai Thani': 'อุทัยธานี',
      Uttaradit: 'อุตรดิตถ์',
      Yala: 'ยะลา',
      Yasothon: 'ยโสธร',
    
};
